# RailingSystemHandrailsLatteralOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RailingSystemHandrailsLatteralOffset Property
ParameterTypeId Class See Also
---
"Lateral Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RailingSystemHandrailsLatteralOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailingSystemHandrailsLatteralOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RailingSystemHandrailsLatteralOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace